{
  "nodes": [
    {
      "op": "null", 
      "param": {}, 
      "name": "data", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "_DivScalar", 
      "param": {"scalar": "127.5"}, 
      "name": "_divscalar0", 
      "inputs": [[0, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_MinusScalar", 
      "param": {"scalar": "1"}, 
      "name": "_minusscalar0", 
      "inputs": [[1, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution0_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution0_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(2,2)", 
        "workspace": "1024"
      }, 
      "name": "convolution0", 
      "inputs": [[2, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation0", 
      "inputs": [[5, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution1_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution1_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(2,2)", 
        "workspace": "1024"
      }, 
      "name": "convolution1", 
      "inputs": [[6, 0], [7, 0], [8, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation1", 
      "inputs": [[9, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution2_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution2_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(2,2)", 
        "workspace": "1024"
      }, 
      "name": "convolution2", 
      "inputs": [[10, 0], [11, 0], [12, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation2", 
      "inputs": [[13, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution3_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution3_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(2,2)", 
        "workspace": "1024"
      }, 
      "name": "convolution3", 
      "inputs": [[14, 0], [15, 0], [16, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation3", 
      "inputs": [[17, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Flatten", 
      "param": {}, 
      "name": "flatten0", 
      "inputs": [[18, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "fullyconnected0_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "fullyconnected0_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "128"
      }, 
      "name": "fullyconnected0", 
      "inputs": [[19, 0], [20, 0], [21, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation4", 
      "inputs": [[22, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "fullyconnected1_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "fullyconnected1_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "2"
      }, 
      "name": "fullyconnected1", 
      "inputs": [[23, 0], [24, 0], [25, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "tanh"}, 
      "name": "activation5", 
      "inputs": [[26, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_MulScalar", 
      "param": {"scalar": "90.1"}, 
      "name": "_mulscalar0", 
      "inputs": [[27, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "softmax_label", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "LinearRegressionOutput", 
      "param": {"grad_scale": "1"}, 
      "name": "ls", 
      "inputs": [[28, 0], [29, 0]], 
      "backward_source_id": -1
    }
  ], 
  "arg_nodes": [
    0, 
    3, 
    4, 
    7, 
    8, 
    11, 
    12, 
    15, 
    16, 
    20, 
    21, 
    24, 
    25, 
    29
  ], 
  "heads": [[30, 0]]
}